[
  {
    "path": "posts/welcome/",
    "title": "Welcome to R for Data Science and Analysis",
    "description": "Welcome to our new blog, R for Data Science and Analysis. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-07-14",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-14T11:34:38+08:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-07-14-the-sharpe-ratio/",
    "title": "VAST Challenge 2021 - Mini-Challenge 3 ",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-07-14",
    "categories": [],
    "contents": "\r\n1. Overview\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\nOn January 23, 2014, multiple events unfolded in Abila. You’ve been asked to come in to perform a retrospective analysis based on limited information about what took place. Your goal is to identify risks and how they could have been mitigated more effectively.\r\nin this assignment we would provide some insights to help law enforcement from Kronos and Tethys.\r\n2. Exploration and preparation of Data\r\nThere are two dataset provides:\r\nMicroblog records that have been identified by automated filters as being potentially relevant to the ongoing incident\r\nText transcripts of emergency dispatches by the Abila, Kronos local police and fire departments.\r\nmaps of Abila and background documents.\r\nTwo dataset are stored in 3 csv files, they are csv-1700-1830.csv“,”csv-1831-2000.csv’ and “csv-2001-2131.csv”:\r\nThe data for Mini-Challenge 3 is found in three segments.\r\nSegment 1 covers the time period from 1700 to 1830 Abila time on January 23.\r\nSegment 2 covers the time period from 1830 to 2000 Abila time on January 23.\r\nSegment 3 covers the time period from 2000 to shortly after 2130 Abila time on January 23.\r\n2.1 Install and load R package\r\nFirst, we run the below code to set the environment.\r\nIn this assignment, the tidyverse, ggforce, GGally, plotly R and parcoords packages will be used, which could be seen from below code chunk.\r\n\r\n\r\npackages = c('tidyverse','dplyr','readr',\r\n             'UpSetR','ggplot2','topicmodels')\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n  install.packages(p)\r\n  }\r\n  library(p,character.only = T)\r\n}\r\n\r\n\r\n\r\n2.2 Import dataset and combine data\r\nThe data of Microblog records and emergency calls are stored in separate csv files. And three csv files share same columns but data generate from different date, which is shown below.\r\n1\r\nFirstly, we need to combine 3 files into one consolidated file, which is necessary for the following analysis. In this step, package ‘tidyverse’ would be used.\r\nThe following R code shows the process of data consolidation, then three dataset with different have been integrated into one file.\r\n\r\n\r\nlibrary(tidyverse)\r\ntable1 <- read.csv(\"csv-1700-1830.csv\")\r\ntable2 <- read.csv(\"csv-1831-2000.csv\")\r\ntable3 <- read.csv(\"csv-2001-2131.csv\")\r\ndata <- rbind(table1, table2,table3)\r\n\r\n\r\n\r\nNext, we would separate ‘ccdata’ and ‘mbdata’, they represent microblog record and emergency call center data collected by the Abila, Kronos local police and fire departments.\r\n\r\n\r\nccdata <- subset(data, type == \"ccdata\")\r\nmbdata <- subset(data, type == \"mbdata\")\r\n\r\n\r\n\r\n2.3 Data preprocessing\r\n2.3.1 Modifying Date formate\r\nDate data in table were shown as scientific notation, so we firstly disabling scientifc notation in R for further date processing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-14T12:10:46+08:00",
    "input_file": "the-sharpe-ratio.knit.md"
  }
]
